# PanelValidateConfigurationError Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MechanicalFailures..::..PanelValidateConfigurationError Property
BuiltInFailures..::..MechanicalFailures Class See Also
---
More than one circuit falls onto the same slot. Disconnect the circuits from the panel?
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId PanelValidateConfigurationError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PanelValidateConfigurationError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ PanelValidateConfigurationError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MechanicalFailures Class
Autodesk.Revit.DB Namespace